Revit 2027 API
BuiltInFailures.SiteFailures.PointRelativeOutside Property
 In order to place Points relative to the existing Surface, the Point must be placed within the area of the existing Surface. The height of the new Point will be relative to the current Surface elevation at that Point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PointRelativeOutside { get; }
Public Shared ReadOnly Property PointRelativeOutside As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PointRelativeOutside {
	FailureDefinitionId^ get ();
}
static member PointRelativeOutside : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace